import React from 'react';
import { Link } from 'react-router-dom';
import PageContainer from '../../blocks/PageContainer';
import { Helmet } from 'react-helmet';
import '../Page.css';

export default function AboutPage() {
  return (
    <>
      <Helmet>
        <title>Про команду Hark!</title>
        <meta
          name='description'
          content='Мета Hark! проста, але благородна. Вона прагне просувати та
          популяризувати українських музичних виконавців. Сайт є мішаниною
          всього: від традиційної української музики до сучасного попу та року.'
        />
      </Helmet>

        <PageContainer>
          <p>
            Сьогодні питання вітчизняного контенту стало дуже гостро у нашому
            суспільстві. Люди відчайдушно шукають музичні гурти та виконавців,
            які виконують пісні українською. Хтось хоче просто додати чогось
            нового у свій плейліст, деякі хочуть замінити пісні, які слухати не
            дозволяє відчуття моралі.
          </p>
          <p>
            Саме для цього було створено простий веб-застосунок Hark! Тут Ви
            зможете знайти як інформацію про певного виконавця, так і гурти у
            відповідності до жанру виконання. Від традиційної української музики
            до сучасного попу та року – знайдіть те, що до душі!
          </p>
          <p>
            Поки певний функціонал знаходиться в розробці, Ви можете приєднатися
            до наших соціальних мереж або <Link className='link' to={'/articles'}>{' '}почитати статті</Link>, що знаходяться на
            сайті.
          </p>
          <p>
            Отже, залишаючись вірними духу Hark!,
            <Link className='link' to={'/'}>{' '}
              давайте підтримувати наших талановитих українських музикантів {" "}
            </Link>
            та допоможемо їм зростати в популярності.
          </p>
          <img
            className='radius-white'
            src="/images/authors.webp"
            alt='Команда Hark! Українські гурти'
          />
        </PageContainer>
        
    </>
  );
}
