import React from 'react';
import { Paper } from '@mui/material';
import BackLink from '../../components/BackLink/BackLink';
import Layout from '../../components/Layout/Layout';
import './AboutPage.css';

const AboutPage = () => {
  return (
    <Layout>
      <Paper>
        <BackLink />
        <p>
          Hark! це платформа, створена талановитим тріо Владиславою Чайкою,
          Анастасією Гойсак та Ростиславом Бибичем. Ми звичайні троє студентів з
          Харківського національного університету радіоелектроніки - мізки
          інноваційного сайту, який завойовує українську музичну індустрію.
          <div>
            <img
              className='author'
              src='vladyslava.jpg'
              alt='Картинка для Владислави Чайки'
            />
            <img
              className='author'
              src='anastasia.png'
              alt='Картинка для Анастасії Гойсак'
            />
            <img
              className='author'
              src='rostuslav.jpg'
              alt='Картинка для Ростислава Бибича'
            />
          </div>
          <br />
          Мета Hark! проста, але благородна. Вона прагне просувати та
          популяризувати українських музичних виконавців. Сайт є мішаниною
          всього: від традиційної української музики до сучасного попу та року.
          З таким різноманіттям, є щось для кожного.
          <br />
          Hark! повністю керується ентузіастами. Ми використовували свою
          пристрасть до музики та технологій, створюючи веб-сайт, який є
          функціональним та зручним у використанні. Ми хочемо наголосити, що
          українська музика варта прослуховування.
          <br />
          Отже, залишаючись вірними духу Hark!, давайте підтримувати наших
          талановитих українських музикантів та допомогти їм зростати в
          популярності.
        </p>
      </Paper>
    </Layout>
  );
};

export default AboutPage;
